In [1]:
import bs4
import urllib.request as url

In [2]:
http = url.urlopen("https://earthquake.usgs.gov/earthquakes/browse/stats.php")

In [3]:
page = bs4.BeautifulSoup(http)

In [55]:
table = page.find("table")

In [56]:
heading = table.find_all('th')

In [57]:
head = []
for data in heading:
#     print(data.text)
    head.append(data.text)

In [58]:
del head[0]

In [82]:
rows = head[-5:]

In [83]:
columns = head[:-5]

In [84]:
print(columns)
print(rows)

['2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018']
['8.0+', '7–7.9', '6–6.9', '5–5.9', 'EstimatedDeaths']

In [85]:
tdList = table.find_all('td')

In [86]:
len(tdList)

95

In [106]:
tdList[:5]

In [87]:
import numpy as np

In [88]:
arr = np.asarray(tdList)

In [89]:
tdArray = arr.reshape(5,19)

In [90]:
for i in range(len(tdArray)):
    for j in range(len(tdArray[i])):
        tdArray[i][j] = tdArray[i][j].text

In [91]:
tdArray

array([['1', '1', '0', '1', '2', '1', '2', '4', '0', '1', '1', '1', '2',
        '2', '1', '1', '0', '1', '1'],
       ['14', '15', '13', '14', '14', '10', ' 9', '14', '12', '16', '23',
        '19', '12', '17', '11', '18', '16', '6', '16'],
       ['146', '121', '127', '140', '141', '140', '142', '178', '168',
        '144', '150', '185', '108', '123', '143', '127', '130', '104',
        '117'],
       ['1344', '1224', '1201', '1203', '1515', '1693', '1712', '2074',
        '1768', '1896', '2209', '2276', '1401', '1453', '1574', '1419',
        '1550', '1455', '1674'],
       ['231', '21357', '1685', '33819', '298101', '87992', '6605',
        '708', '88708', '1790', '226050', '21942', '689', '1572', '756',
        '9624', '', '', '']], dtype=object)

In [92]:
import pandas as pd

In [93]:
df = pd.DataFrame(tdArray)

In [98]:
df.columns = columns

In [99]:
df.head()

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,1,1,0,1,2,1,2,4,0,1,1,1,2,2,1,1,0,1,1
1,14,15,13,14,14,10,9,14,12,16,23,19,12,17,11,18,16,6,16
2,146,121,127,140,141,140,142,178,168,144,150,185,108,123,143,127,130,104,117
3,1344,1224,1201,1203,1515,1693,1712,2074,1768,1896,2209,2276,1401,1453,1574,1419,1550,1455,1674
4,231,21357,1685,33819,298101,87992,6605,708,88708,1790,226050,21942,689,1572,756,9624,,,

In [100]:
df.index = rows

In [101]:
df.head()

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
8.0+,1,1,0,1,2,1,2,4,0,1,1,1,2,2,1,1,0,1,1
7–7.9,14,15,13,14,14,10,9,14,12,16,23,19,12,17,11,18,16,6,16
6–6.9,146,121,127,140,141,140,142,178,168,144,150,185,108,123,143,127,130,104,117
5–5.9,1344,1224,1201,1203,1515,1693,1712,2074,1768,1896,2209,2276,1401,1453,1574,1419,1550,1455,1674
EstimatedDeaths,231,21357,1685,33819,298101,87992,6605,708,88708,1790,226050,21942,689,1572,756,9624,,,

In [102]:
df = df.transpose()

In [103]:
df.head()

     8.0+ 7–7.9 6–6.9 5–5.9 EstimatedDeaths
2000    1    14   146  1344             231
2001    1    15   121  1224           21357
2002    0    13   127  1201            1685
2003    1    14   140  1203           33819
2004    2    14   141  1515          298101

In [104]:
df.tail()

     8.0+ 7–7.9 6–6.9 5–5.9 EstimatedDeaths
2014    1    11   143  1574             756
2015    1    18   127  1419            9624
2016    0    16   130  1550
2017    1     6   104  1455
2018    1    16   117  1674